app/Http/Controllers/Api/BookableController.php

    public function index()
    {
        return BookableIndexResource::collection(
            Bookable::all()
        );
---
select * from `bookables`